In [1]:
import pandas as pd
# 打印DataFrame设置
# 显示所有列
pd.set_option('display.max_columns',None)
# 显示所有列
pd.set_option('display.max_rows',None)
# 设置value显示长度，默认为50
pd.set_option('max_colwidth',100)
# 载入
%load_ext sql
# 连接mysql数据库 用户名root 密码root123 本地数据库localhost 数据库名geek_learning
%sql mysql+pymysql://root:root123@localhost/geek_learning?charset=utf8

C:\ProgramData\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

'Connected: root@geek_learning'

#### 练习：用一条 SQL 语句显示出所有可能的比赛组合  
分析：是否分主、客场，有两种情况。

In [2]:
%%sql
SELECT a.team_name, 'VS', b.team_name
FROM team AS a, team AS b
WHERE a.team_id<>b.team_id
;

 * mysql+pymysql://root:***@localhost/geek_learning?charset=utf8
6 rows affected.

[('印第安纳步行者', 'VS', '底特律活塞'),
 ('亚特兰大老鹰', 'VS', '底特律活塞'),
 ('底特律活塞', 'VS', '印第安纳步行者'),
 ('亚特兰大老鹰', 'VS', '印第安纳步行者'),
 ('底特律活塞', 'VS', '亚特兰大老鹰'),
 ('印第安纳步行者', 'VS', '亚特兰大老鹰')]

In [3]:
%%sql
SELECT a.team_name,'VS',b.team_name
FROM team AS a, team AS b
WHERE a.team_id<b.team_id
;

 * mysql+pymysql://root:***@localhost/geek_learning?charset=utf8
3 rows affected.

[('底特律活塞', 'VS', '印第安纳步行者'),
 ('底特律活塞', 'VS', '亚特兰大老鹰'),
 ('印第安纳步行者', 'VS', '亚特兰大老鹰')]

#### 练习 查询不同身高级别（对应 height_grades 表）对应的球员数量（对应 player 表）。  
分析：注意有的级别没有球员。

In [4]:
%%sql
SELECT * FROM height_grades

 * mysql+pymysql://root:***@localhost/geek_learning?charset=utf8
4 rows affected.

[('A', 2.0, 2.5), ('B', 1.9, 1.99), ('C', 1.8, 1.89), ('D', 1.6, 1.79)]

In [5]:
%%sql
SELECT * FROM player LIMIT 5;

 * mysql+pymysql://root:***@localhost/geek_learning?charset=utf8
5 rows affected.

[(10001, 1001, '韦恩-艾灵顿', 1.93),
 (10002, 1001, '雷吉-杰克逊', 1.91),
 (10003, 1001, '安德烈-德拉蒙德', 2.11),
 (10004, 1001, '索恩-马克', 2.16),
 (10005, 1001, '布鲁斯-布朗', 1.96)]

In [6]:
%%sql
SELECT a.height_level,COUNT(b.height) AS player_num
FROM height_grades AS a LEFT JOIN player AS b
ON b.height BETWEEN a.height_lowest AND a.height_highest
GROUP BY a.height_level
ORDER BY a.height_level
;

 * mysql+pymysql://root:***@localhost/geek_learning?charset=utf8
4 rows affected.

[('A', 18), ('B', 14), ('C', 5), ('D', 0)]